---
kind: method
id: M:Autodesk.Revit.DB.Analysis.AnalysisDisplayStyle.SetLegendSettings(Autodesk.Revit.DB.Analysis.AnalysisDisplayLegendSettings)
source: html/5f064028-6655-ec4b-3b3c-686ec59ea3c1.htm
---
# Autodesk.Revit.DB.Analysis.AnalysisDisplayStyle.SetLegendSettings Method

Set legend settings object for the style.

## Syntax (C#)
```csharp
public void SetLegendSettings(
	AnalysisDisplayLegendSettings legendSettings
)
```

## Parameters
- **legendSettings** (`Autodesk.Revit.DB.Analysis.AnalysisDisplayLegendSettings`)

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentNullException** - A non-optional argument was null